#pragma once
#include <windows.h>
#include <array>

struct 识图坐标
{
	int x,y;
	std::array<BYTE, 3> 颜色;
};
class 识图类
{
private:
	//示例 识图坐标 图色={0,0};
	HDC hDCScreen;//249,190,145
	识图坐标 Auto坐标1 = { 1226,537,{200,190,145} };
	识图坐标 Auto坐标2 = { 1241,539,{200,190,145} };
	识图坐标 Quest坐标1 = { 1223,538,{200,190,145} };
	识图坐标 Quest坐标2 = { 1249,540,{200,190,145} };
	识图坐标 生命力药水 = { 909,713,{159,18,13} };
	识图坐标 跳过1 = {};
	识图坐标 跳过2 = {};
	识图坐标 装备穿戴1 = {};
	识图坐标 装备穿戴2 = {};
	识图坐标 据点1 = { 1047,215,{33,68,108} }; //R<100 蓝色 上下20左右变动吧
	识图坐标 据点2 = { 1045,189,{50,93,128} }; //B>100
	识图坐标 通行证 = { 218,45,{228,71,68} }; //R>200
	识图坐标 菜单红点 = { 1256,45,{228,71,68} }; //R>200
	识图坐标 成就红点 = { 1110,174,{228,71,68} }; //R>200
	识图坐标 邮箱红点 = { 1062,689,{230,76,74} }; //R>200
	识图坐标 信念传承红点 = { 1207,174,{230,76,74} };
	识图坐标 收藏红点 = { 1256,116,{230,76,74} };
	识图坐标 坐骑红点 = { 1159,239,{227,66,64} };
	识图坐标 武器外形红点 = { 1256,238,{230,76,74} };
public:
	识图坐标 强化最大安全阶段 = { 165,734,{158,139,99} };//RG>100
	void 初始化();
	std::array<BYTE, 3> 识别颜色(识图坐标 坐标);
	bool isAuto();
	bool isQuest();
	bool 查找跳过();
	bool 查找装备穿戴();
	bool 生命力药水用完();
	bool 查找大地图据点();
	bool 通行证可领取();
	bool 查找菜单红点();
	bool 查找成就红点();
	bool 查找强化最大安全阶段();
	bool 查找邮箱红点();
	bool 查找信念传承红点();
	bool 查找收藏红点();
	bool 查找坐骑红点();
	bool 查找武器外形红点();
	bool 检查范围内颜色(int x, int y, int width, int height, std::array<BYTE, 3> &color,int dis=4);
private:
	void ColorRefToArray(COLORREF color, std::array<BYTE, 3>& arr);
	
};

