#pragma once
#include <string>

using namespace std;

struct 识字坐标
{
	int x1, y1, x2, y2;
};
class 识字类
{
private:
	识字坐标 AUTO = { 1218,532,1254,552 };
	
	HRESULT hr;
	IDispatch* pDispatch;
	DISPID dispid;
	
public:
	HMODULE LoadDll();
public:
	识字坐标 跳过 = { 1181,58,1216,77 };
	识字坐标 装备坐骑 = { 1014,103,1067,121};
	识字坐标 任务 = { 1014,103,1067,121 };
	/*滑翔翼，坐骑穿戴*/
	识字坐标 穿戴 = { 1158,706,1197,727 }; 
	识字坐标 添加 = { 1158,706,1197,727 };
	识字坐标 装备穿戴 = { 994,462,1019,478 };
	识字坐标 瞬间移动 = {588,269,649,286};
	识字坐标 购买 = { 865,547,903,567 };
	识字坐标 请点击画面 = { 611, 559, 685, 577 };
	识字坐标 武器外形穿戴 = { 1112, 706,1149 , 727 };
	识字坐标 节电模式 = { 639, 140,703 , 158 };

	IDispatch* COM初始化();
	bool 查找跳过();
	bool 查找装备坐骑();
	bool 查找穿戴();
	bool 查找装备穿戴();
	bool 查找添加();
	bool 查找瞬间移动();
	bool 查找购买();
	bool 查找请点击画面();
	bool 查找武器外形穿戴();
	bool 查找节电模式();
	std::wstring 获取字符(识字坐标 坐标);
};

